In [1]:
%run helper/setup_notebook.ipynb import display_table

Successfully connected to leetcode50 database.

In [2]:
display_table('Person')

+----+------------------+
| Id |      Email       |
+----+------------------+
| 1  | john@example.com |
| 2  | bob@example.com  |
| 3  | john@example.com |
+----+------------------+

### Delete all the duplicate emails, keeping only one unique email with the smallest id.

#### *(For SQL users, please note that you are supposed to write a DELETE statement and not a SELECT one.)*

```
+----+------------------+
| id | email            |
+----+------------------+
| 1  | john@example.com |
| 2  | bob@example.com  |
+----+------------------+
Explanation: john@example.com is repeated two times. We keep the row with the smallest Id = 1.
```

In [3]:
%%sql 

SELECT 
    p1.id,
    p1.email
FROM Person p1
JOIN Person p2

[(3, 'john@example.com'),
 (2, 'bob@example.com'),
 (1, 'john@example.com'),
 (3, 'john@example.com'),
 (2, 'bob@example.com'),
 (1, 'john@example.com'),
 (3, 'john@example.com'),
 (2, 'bob@example.com'),
 (1, 'john@example.com')]

In [4]:
%%sql 

SELECT 
    p1.id,
    p1.email
FROM Person p1
JOIN Person p2 ON p1.email = p2.email

[(3, 'john@example.com'),
 (1, 'john@example.com'),
 (2, 'bob@example.com'),
 (3, 'john@example.com'),
 (1, 'john@example.com')]

In [5]:
%%sql 
-- This is duplicate record that would have been selected for deletion 
SELECT 
    p1.id,
    p1.email 
FROM Person p1 
JOIN Person p2 ON p1.email = p2.email
WHERE p1.id > p2.id

[(3, 'john@example.com')]

## Using Pandas

In [6]:
person_query = %sql SELECT * FROM person # type: ignore
person_df = person_query.DataFrame()

display(person_df)

   Id             Email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

In [7]:
person_df.drop_duplicates()

   Id             Email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

In [8]:
#  To remove duplicates and keep last occurrences, use ``keep``.
person_df.drop_duplicates(subset=['Email'], keep='last')

   Id             Email
1   2   bob@example.com
2   3  john@example.com

In [9]:
person_df.drop_duplicates(subset=['Email'])

   Id             Email
0   1  john@example.com
1   2   bob@example.com